[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 488,
    "title": "Biden Pledges Nearly $3 Billion To Ukraine In Largest U.S. Military Aid Package Yet",
    "author": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://i.ibb.co/M23fhxm/unsplash-Eh-Tc-C9s-YXsw.png",
    "details": "Wednesday, August 24, 2022 | Tag Cloud Tags: Biden, EU, Euro, Europe, Joe Biden, Military, News, Russia, Security, UK, Ukraine, United States, Worthy News (Worthy News) – U.S. President Joe Biden has announced nearly $3 billion in new U.S. military aid for Kyiv as Ukraine marked its independence day six months after Russia invaded the country.'The United States of America is committed to supporting the people of Ukraine as they continue the fight to defend their sovereignty. As part of that commitment, I am proud to announce our biggest tranche of security assistance to date: approximately $2."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "3",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 560,
    "title": "West Ham continued their successful start to life in the Europa League with a record-breaking victory at Freiburg.",
    "author": {
      "name": "Jonathan Franzen",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://th.bing.com/th/id/R.af1bcf25049caf328b8da7eb6d566d2f?rik=0sB4X%2fb5vbmkKg&riu=http%3a%2f%2fi.huffpost.com%2fgadgets%2fslideshows%2f306562%2fslide_306562_2651832_free.jpg&ehk=U0zTbRTIOo6fuYHhQarm3wF097%2b3Q2Jsp0OGdVspJw0%3d&risl=&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://ichef.bbci.co.uk/onesport/cps/800/cpsprodpb/17466/production/_131343359_gettyimages-1708723297.jpg",
    "details": "West Ham were particularly threatening on the break in the first half as Bowen and Mohammed Kudus troubled the Freiburg defence. David Moyes' men limited Freiburg to just one shot on target before the break - a tame effort that was easily caught by Lukasz Fabianski. Freiburg were unsettled and struggled to cope with the pressure from West Ham but managed to remain in contention given the visitors' slim lead. The game's momentum shifted when Sallai lashed the equaliser past Fabianski, and Lucas Holer should have put Freiburg in front when he somehow blasted over the bar from six yards. West Ham were therefore relieved when careless positioning from Atubolu allowed Aguerd to meet Ward-Prowse's corner and restore the lead, the decisive goal coming against the run of play. West Ham, who beat Backa Topola in their opening Europa League game, top Group A with six points. Freiburg are second and sit three points behind."
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71011",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.8,
      "badge": "Excellent"
    },
    "total_view": 400,
    "title": "Tucker Carlson Swears Vladimir Putin Is Winning The War In Ukraine",
    "author": {
      "name": "Euan Myles",
      "published_date": "2022-08-30 16:38:45",
      "img": "https://images.huffingtonpost.com/2013-12-24-BestsellingauthorJames-thumb.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
    "image_url": "https://i.ibb.co/BZZ5WKv/unsplash-Eh-Tc-C9s-YXsw-4.png",
    "details": "Tucker Carlson has rarely met a dictator's ass he didn't want to kiss, and Vladimir Putin is at the very top of that puckering up list. The Fox News host is something of a folk hero in Russia: Because of the pro-Putin propaganda he so often spews, the Kremlin has encouraged Russia's state TV to air as much of Tucker's face as possible — and they're certain to love his latest rant about how Putin is winning the war in Ukraine, which does not seem to be the case. But on Fox News, what Tucker says goes."
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "2",
    "rating": {
      "number": 4.3,
      "badge": "Excellent"
    },
    "total_view": 400,
    "title": "Quiz of the week: Which university is opening a world of magic?",
    "author": {
      "name": "Jennifer Wood",
      "published_date": "2022-08-30 16:38:45",
      "img": "https://th.bing.com/th/id/R.ea9b3f0b4b590d52b5bcb285d0802341?rik=dhLv688sNEuWqg&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
    "image_url": "https://cdn.riddle.com/embeds/v2/images/q_80,c_fill,w_960,h_540/21f/21fd81423a11b026397a8c280f4bfeaa.png",
    "details": "A new master's degree will allow students to explore the history and impact of witchcraft and magic around the world, a university in the UK said. Which of these subjects is not among the modules in the course at the University of Exeter?"
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f9",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "3",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 980,
    "title": "Putin makes nuclear-powered Burevestnik missile test claim",
    "author": {
      "name": "Keith Ferrazzi",
      "published_date": "2022-08-24 23:15:00",
      "img": "https://th.bing.com/th/id/R.5413307ae2727e757dda297277916386?rik=jUragyjHo4dtNA&riu=http%3a%2f%2fstatic4.businessinsider.com%2fimage%2f5910883252b5d89d018b50ed-1190-625%2fthe-author-of-a-business-classic-says-a-mistake-he-made-in-college-is-still-one-of-the-worst-of-his-career.jpg&ehk=pdfqxHVgLducPjtvRCC4%2fhaDIlSqINYr3PbkqQwyyDc%3d&risl=&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
    "image_url": "https://ichef.bbci.co.uk/news/976/cpsprodpb/1413A/production/_131343228_tv088439390.jpg.webp",
    "details": "The president's comments came after his spokesman rejected a New York Times report that testing of the weapon, known as the Burevestnik, was imminent. The experimental weapon, first announced in 2018, has been hailed as having a potentially unlimited range. It is said to be powered by a nuclear reactor and is capable of carrying a nuclear warhead. But little is officially known of its capabilities and there are reports that previous tests have failed. President Putin's account has not been independently confirmed and there has been no word so far from the Russian defence ministry. However, satellite images circulated last month indicated that Russia had recently built new facilities at a remote Arctic island location where Soviet nuclear tests were previously conducted. The images showed construction work on Novaya Zemlya, an island archipelago in the northern Barents Sea."
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f0",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 980,
    "title": "Biden attacked from both sides over new Texas border wall",
    "author": {
      "name": "Robert Plummer",
      "published_date": "2022-08-24 23:15:00",
      "img": "https://fr.web.img6.acsta.net/pictures/18/04/06/15/40/1259844.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
    "image_url": "https://i.ibb.co/T0PnZxD/unsplash-Eh-Tc-C9s-YXsw-8.png",
    "details": "Mr Biden said he was unable to stop the work because the funding was signed off while Donald Trump was president Members of his Democratic Party said walls did not work, while rival Republicans accused him of hypocrisy. Some 20 miles (32km) of barriers will be built in a sparsely populated stretch of the Rio Grande Valley. While campaigning for president in 2020, Mr Biden promised he would not build another foot of wall if elected. He said it was 'not a serious policy solution'. But on Wednesday, his administration used its sweeping executive powers to waive more than two dozen federal laws, including some that are designed to protect wildlife, to allow more barriers to be built along the US-Mexico border in southern Texas.In a notice announcing these waivers, Homeland Security Secretary Alejandro Mayorkas said there was an 'acute and immediate need' for the construction.It prompted swift criticism from both major parties as well as from environmental activists and human rights groups."
  },
  {
    "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "2",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 921,
    "title": "Taylor Swift tour film tops $100m in advance ticket sales",
    "author": {
      "name": "Mariko Oi",
      "published_date": "2022-08-30 15:00:04",
      "img": "https://infonurse.it/wp-content/uploads/2021/08/caro-ministro-madia-e-cari-sindacati-firmatari-800x445.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
    "image_url": "https://ichef.bbci.co.uk/news/976/cpsprodpb/6C60/production/_131344772_gettyimages-1636796802.jpg.webp",
    "details": "Swift's global tour, which is scheduled to continue until late 2024, is also on track to become the biggest in history. Stadium ticket sales could reach $1.4bn which would break the record currently held by Elton John for his farewell tour. The film of the Eras tour is due to be released in cinemas in more than 100 countries next Friday. Analysts estimate that in addition to advance ticket sales, the film could see another $100m of box office takings in North America on its opening weekend. Five films - including Barbie, The Super Mario Bros. Movie and Spider-Man: Across the Spider-Verse - have generated more than $100m in their North America debut this year. AMC is also distributing the movie of Beyonce's Renaissance tour, which is set to be released in December. Last year, Swift became the first artist in history to have songs in every slot of the top 10 US singles chart. She overtook Drake, who held the previous record of nine top 10 singles at the same time in September 2021. The Beatles previously held the record in 1964 with eight singles in the top 10.The news came after she released her third re-recorded album in July - Speak Now (Taylor's Version) - which hit the top of the US and UK charts. Later this month, Swift will release her next re-recorded album 1989 (Taylor's Version). She is re-recording her earlier albums because it will allow her to own the songs' original recordings."
  },
  {
    "_id": "a713ee936ff5574273f0f769f5c5b20e",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "3",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 111,
    "title": "America Imported Over $6 Billion in Goods From Russia Since Ukraine Invasion",
    "author": {
      "name": "Caitlin Halderen",
      "published_date": null,
      "img": "https://i.pinimg.com/originals/1a/2a/ff/1a2aff31787fbbb1eb7a0de49f5dbf9b.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://i.ibb.co/xh57pkr/unsplash-Eh-Tc-C9s-YXsw-1.png",
    "details": "To receive Global Research's Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** In response to Russia's attack on Ukraine, US President Joe Biden vowed to isolate... read full story"
  },
  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
    "others_info": {
      "is_todays_pick": true,
      "is_trending": false
    },
    "category_id": "4",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 733,
    "title": "Shaquille O’Neal auctions a 1000 size 22 Reeboks for $999.32 each!",
    "author": {
      "name": "Jane De Leon",
      "published_date": "2022-08-25 06:03:00",
      "img": "https://th.bing.com/th/id/OIP.9AO37Q9Olf4lPq8JmYssLwHaJT?pid=ImgDet&rs=1"
    },
    "thumbnail_url": "https://i.ibb.co/j86wjDW/unsplash-Eh-Tc-C9s-YXsw-20.png",
    "image_url": "https://i.ibb.co/WNrB5d7/unsplash-Eh-Tc-C9s-YXsw-9.png",
    "details": "1,000 pairs of autographed Size 22 Reeboks were made available thanks to a partnership between Shaquille O’Neal and Steiner Sports. Shaquille O’Neal is a larger-than-life character in every way. We’re talking about a superstar who earned as many self-styled nicknames as he did awards, a man who made his NBA debut by traveling from coast to coast like a speeding freight train. Naturally, O’Neal was also physically larger than most people due to his 7ft height and 300-pound weight. His absurd size 22 shoes could serve as an oversized phone for Allen Iverson. .@SHAQ‘s signature is going global. The 4x @NBA champ is bringing his SHAQ shoes to South Africa — priced between R799 & R999 ($52 – $65 USD) for children and adults. Shaq says the current line is aimed at “everyday consumers.” pic.twitter.com/MWEHdVZOX0 — Boardroom (@boardroom) January 16, 2022 O’Neal is a well-known figure outside of basketball, where he found tremendous success. The former NBA player is now much more than that because he is well-known all over the country. Shaq gained a lot of admirers by choosing to work with Wall-Mart to launch an affordable footwear line. This helped in solidifying his legacy beyond his playing career. Budget-friendly children’s shoes from O’Neal and the supermarket chain have been well received. Also, read – Anthony Davis and Patrick Beverley – A combination that will potentially make the Los Angeles Lakers a top-ranking defensive side again Shaquille O’Neal agreed to release a thousand autographed size-22 Shaq Attaq shoes for a premium! Shaq was the latest to cash in on the growing wave of collectors, as sports memorabilia for the biggest basketball stars of the 1990s continues to rise in demand. O’Neal has collaborated with Steiner Sports to release 1,000 unique pairs of his first-ever Reebok signature shoe. The Shaq Attaq; each shoe has a unique signature, numbered 32 or 34, with various call-outs to the Diesel’s career achievements such as “HOF 16” and much more. Each pair costs $999.32 and comes in a special glass case with personalized inscriptions. Shoe In: @shaq & @steinersports team up to offer 1,000 size 22 signed rookie shoes for $999.32 each pic.twitter.com/ypm5PFrEk7 — Darren Rovell (@darrenrovell) August 4, 2016 O’Neal collaborated with Steiner Sports, according to ESPN’s Darren Rovell, to provide fans with a pair of his signature shoes. 1,000 pairs of his first signature shoe—the Reebok Shaq Attaq—from his first season with the Orlando Magic were released. The limited edition shoes will cost a staggering $999.32 and come in Shaq’s size 22 feet. The CEO of Steiner Sports, Brandon Steiner, also said that this is just the beginning. The company will continue to produce other O’Neal memorabilia. These include shoes and jerseys that he wore for all of the NBA teams Shaq represented. Also, read – Michael Jordan, who owns a $15 million golf course, once openly mocked President Clinton in a game The post Shaquille O’Neal auctions a 1000 size 22 Reeboks for $999.32 each! appeared first on The SportsRush."
  },
  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7901",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "4",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 733,
    "title": "George Russell wears $110 Daniel Ricciardo merchandise to Zandvoort paddock ahead of Dutch GP",
    "author": {
      "name": "Theo Minh Châu",
      "published_date": "2022-08-25 06:03:00",
      "img": "https://images.summitmedia-digital.com/preview/images/2022/11/24/paul-unating-jane.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/df3gJ1b/unsplash-Eh-Tc-C9s-YXsw-13.png",
    "image_url": "https://i.ibb.co/Z2JjRnF/unsplash-Eh-Tc-C9s-YXsw-2.png",
    "details": "Mercedes’ George Russell arrived at the Zandvoort paddock wearing a Daniel Ricciardo merchandise ahead of the Dutch GP. Ricciardo is one of the most popular and marketable drivers in F1 today. Millions of fans around the world love and idolize him, and his merchandise is one of the highest-selling among all active F1 drivers. It seems as though George Russell himself is a huge fan of the former Red Bull star. Ahead of the 2022 Dutch Grand Prix, Russell arrived at Zandvoort sporting Ricciardo’s merch. He wore a full-sleeve sweater with ‘Enchante’ written on it, and according to the Aussie’s website, it costs $110. something about george russell in daniel ricciardo merch pic.twitter.com/1Z9ZqQ4Lm1 — abs (@footonthegasIy) September 1, 2022 Some people on social media also reported that the 24-year-old was not wearing his own sweater. It was his girlfriend’s sweater, and F1 Twitter loved the fact that both he and his partner are fans of the honey badger! george russell and daniel ricciardo you will always be famous pic.twitter.com/2g2cik6P5P — s (@formullana) September 1, 2022 Ricciardo is having a tough time on track in 2022, but even he will feel good to know that he has so many fans around the world who still love him. Also read: “I have a lot of respect for Ferrari in general”: 24-year old Max Verstappen shares thoughts on $1.35 billion rival team Where will Daniel Ricciardo drive in 2023? Ricciardo’s departure at the end of the season was confirmed by McLaren in August. The Perth-born driver was not performing up to expectations and the Surrey-based outfit decided to pull the plug early. This was not a popular decision, as many people including Sebastian Vettel and Lewis Hamilton felt that the 33-year-old should have gotten more time. For now, he is without an F1 seat but he’s too valuable a driver to remain on the sidelines. Strong rumors have linked him back to a move to Alpine. Team boss Otmar Szafnauer has not confirmed anything as of yet, but he remains the favorite. This is especially because their junior driver Oscar Piastri, who was first choice to replace Fernando Alonso at the team is reportedly on his way to McLaren. There are some other teams who are interested in securing the services of Ricciardo. Both him and Haas team principal Guenther Steiner recently admitted that they held talks about their 2023 seat a few weeks ago. A decision regarding his future in F1 is expected to be announced very soon. Also read: McLaren F1 to save fund from Daniel Ricciardo’s $16 Million Contract to secure Oscar Piastri   The post George Russell wears $110 Daniel Ricciardo merchandise to Zandvoort paddock ahead of Dutch GP appeared first on The SportsRush."
  },
  {
    "_id": "f06f8cc035b04bd1158e4198281915a3",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "5",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 127,
    "title": "9 Things to do in Colorado this Labor Day weekend",
    "author": {
      "name": "Ukrainska Pravda",
      "published_date": "2022-08-25 18:53:49",
      "img": "https://th.bing.com/th/id/R.e1227a945972f2b55918b86206efbaf6?rik=%2f78lYjDXNhAigQ&riu=http%3a%2f%2f2.bp.blogspot.com%2f_8ZR3RtzcG9A%2fS9kA-nFkAqI%2fAAAAAAAAB4M%2fXYNfupt8fqY%2fs1600%2fcallum_keith_rennie_headshot1.jpg&ehk=JXqP659oMBC0NNLXgq%2byTQVH1O1zwgV6j%2fkJNnBC%2f7U%3d&risl=&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/0swsWpF/unsplash-Eh-Tc-C9s-YXsw-17.png",
    "image_url": "https://i.ibb.co/H4p2t3V/unsplash-Eh-Tc-C9s-YXsw-6.png",
    "details": "COLORADO, USA — Happy Labor Day weekend! Although it may be the unofficial end to summer, there's still time to head outdoors and experience all that Colorado has to offer during the season. Taste of Colorado highlights a packed weekend of festivals which includes music, food, arts, crafts, balloon, wine and beer celebrations. There are early signs of autumn, however. College football is back with three games this weekend and the first Oktoberfest steins of the year will be raised in Keystone and Beaver Creek. Check out one of these awesome events happening across the Centennial State this Labor Day weekend. Remember to share your weekend photos with the \"Near Me\" feature on the 9NEWS app. > Submit an event to 9Things To Do . Credit: A Taste of Colorado Taste of Colorado DENVER — Colorado's signature Labor Day weekend festival is back at Civic Center Park in downtown Denver. The 39th annual Taste of Colorado will be held Saturday, Sept. 3 to Monday, Sept. 5. This year's event features five stages where attendees can listen to music from more than 60 artists including tribute bands, country musicians, jazz, cultural lineups and Denver bands. An Arts & Crafts Marketplace will have 50 local artisan booths and over 30 food trucks and restaurant vendors. Credit: Colorado State Fair Colorado State Fair PUEBLO — T he largest summer event in Colorado continues this weekend in southern Colorado. The Colorado State Fair offers a carnival, 4-H exhibits, agricultural competitions, tractor pulls, live music performances, rodeos, bake offs and amazing food options. T he Colorado State Fair runs through Monday, Sept. 5 with concerts from The Band Perry and Stone Temple Pilots, p lus monster truck shows and a demolition derby. Check out the full fair schedule at ColoradoStateFair.com . Credit: Windsor Harvest Festival The 96th Annual Windsor Harvest Festival arrives September 2 to 4, 2018 in Windsor, Colorado. Photo Courtesy: Windsor Harvest Festival. Windsor Harvest Festival WINDSOR — Windsor's largest family-friendly event is back for a 100th year this Labor Day weekend. This year's Windsor Harvest Festival theme is \"Build for the Future While Honoring the Past.\" The festival runs from Saturday, Sept. 3 to Monday, Sept. 5 with live music, a street dance, BBQ, car show, pancake breakfast, horse-drawn carriage rides, outdoor games, beer garden, movie screening in the park, and firework show. Balloon launches are planned for Saturday and Sunday at 6:30 a.m. at Eastman Park. A parade steps off at 9 a.m. Monday. Visit W indsorHarvestFestival.com to see the complete schedule. Credit: Colorado Springs Labor Day Lift Off Labor Day Lift Off COLORADO SPRINGS — A Southern Colorado tradition returns this weekend with the Colorado Springs Labor Day Lift Off . Running Saturday, Sept. 3 through Monday, Sept. 5, the free event begins each morning with an ascension of over 70 balloons accompanied by breakfast and drinks from local vendors. Throughout each day there will be skydiving demonstrations, wakeboarding exhibitions, paddle boarding and live entertainment. Evening balloon glows are set for Saturday and Sunday at 7:30 p.m. The Colorado Springs Labor Day Lift Off takes place at Memorial Park. Credit: Matthew Murphy Hadestown Hadestown DENVER — \"Hadestown,\" the winner of eight Tony Awards in 2019 including Best Musical, has just opened at Denver's Buell Theatre. \"Hadestown\" intertwines the tales of young dreamers Orpheus and Eurydice with that of King Hades and his wife Persephone on hell-raising journey to the underworld and back. With an exceptional cast of actors, dancers and singers, the musical is a haunting but hopeful theatrical experience that grabs you and never lets go. \"Hadestown\" plays the Buell Theatre through Sunday, Sept. 11. Credit: Denver Chalk Art Festival Denver Chalk Art Festival DENVER — The annual Denver Chalk Art Festival has moved to Denver's Golden Triangle neighborhood this weekend. The street painting festival, which runs Saturday, Sept. 3 through Monday, Sept. 5, will have 150 artists creating awe-inspiring works of chalk art. The festival is two blocks south of Civic Center Park (and Taste of Colorado) near 12th and Bannock and the Denver Art Museum. Credit: Seven Peaks Music Festival Seven Peaks Music Festival VILLA GROVE — Seven Peaks Music Festival returns for a third edition this weekend with a star-studded country music lineup. Dierks Bentley and Morgan Wallen headline the festival with guests Boy Named Banjo, Ashley Cooke, Jordan Davis, Jackson Dean, Travis Denning, Hardy, Kendell Marvel, Ashley McBryde, Old Crow Medicine Show, Caitlyn Smith, Rapidgrass, Alana Springsteen and Lainey Wilson. Seven Peaks Music Festival runs Friday, Sept. 2 to Sunday, Sept. 4 in Villa Grove, located about 45 miles south of Buena Vista. Labor Day Weekend in Creede CREEDE — Creede's Labor Day Weekend celebration is packed with events including a mountain run, outdoor movie, music, theater and more. The 36th annual Creede Mountain Run takes place Saturday, Sept. 3. Participants will enjoy the breathtaking San Juan Mountains in 50K, 22 mile, 12 mile and two-mile runs. Registration is available online . To see the complete Labor Day Weekend schedule, visit Creede.com . Credit: KUSA TCU vs. Colorado BOULDER — The University of Colorado football teams opens the 2022 season on Friday, Sept. 2. The CU Buffaloes host TCU in a nationally-televised game on ESPN with an 8 p.m. kickoff. Fans are encouraged to wear black to the game. A new sound system will also make its debut at Folsom Field on Friday. Season and single game tickets remain available at CUBuffs.com . RELATED: CU's football stadium will sound different in opener vs. TCU Northern Iowa vs. Air Force COLORADO SPRINGS — Air Force Academy football opens its season on Saturday, Sept. 3 against Northern Iowa in the first meeting between the schools. Northern Iowa head coach Mark Farley enters his 22nd season with the Panthers as the most winningest coach in program history. Air Force Falcons head coach Troy Calhoun is 15-0 against teams from the Football Championship Subdivision. The Falcons and Panthers kick off at 11 a.m. Saturday at Falcon Stadium. Houston Baptist vs. Northern Colorado GREELEY — University of Northern Colorado head coach Ed McCaffrey leads the Bears onto the field at Nottingham Field on Saturday, Sept. 3 at 2 p.m. against Houston Baptist. Last year, linebacker David Hoage recorded three sacks against Houston Baptist, the most since 2017. Fans should arrive early for the Pepsi Fan Fest, Bears, Brews and Bites and tailgate with fellow Bear fans. Credit: Water World Water World’s final weekend FEDERAL HEIGHTS — This is the final weekend of 2022 to visit one of America's largest family water parks. Water World 's final three days of operation this season are Saturday, Sunday and Monday. Water World features more than fifty attractions, from kids rides to huge thrill rides. Most food and drinks can be brought into the park making it perfect for picnics and parking is free. Avoid the lines and get your tickets online . Elitch Gardens water park DENVER — Elitch Gardens closes its water park on Sunday, Sept. 4. The main amusement park area will remain open through Sunday, Oct. 30 in downtown Denver. Credit: Cirque du Soleil Ovo LOVELAND — Cirque du Soleil has brought a touring circus to Colorado for the first time since 2019. \"Ovo\" is in Colorado Springs before heading to Denver next weekend. The show \"Ovo\" — meaning \"egg\" in Portuguese — is comprised of 100 people from 25 countries, including 52 artists, with high-level acrobatic acts. \"Ovo\" is at Broadmoor World Arena through Sunday, Sept. 4. Tickets are sold at AXS.com . RELATED: Cirque du Soleil returns to Colorado Credit: Jurassic World: The Exhibition Jurassic World: The Exhibition DENVER — This is the final weekend to see \"Jurassic World: The Exhibition\" at the Stockyards Event Center of the National Western Center. An immersive 20,000-square-foot experience based on the blockbuster movie franchise, \"Jurassic World: The Exhibition\" allows visitors to walk through the world-famous Jurassic gates, encounter life-sized dinosaurs and explore richly themed environments. Tickets are on sale at JurassicWorldExhibition.com . The show will be in Denver through Monday, Sept. 5. Credit: Taryn Parker; Broncos 7K Broncos Fit 7K DENVER — The 10th annual Broncos Fit 7K returns to Empower Field at Mile High on Sunday, Sept. 4. All runners will receive an exclusive Broncos shirt, finisher's medal and the experience of racing across the field and crossing the 50-yard line. Proceeds will benefit Denver Broncos Charities. Register at DenverBroncos.com . Labor Day Half Marathon, 10K and 5K PARKER — Celebrate the holiday weekend with a half marathon, 10K or 5K . There's a distance for everyone at Monday's races at Parker's Salisbury Equestrian Park. Runners of all abilities are welcome. Each participant gets a running shirt, finisher's medal, chip timing and race photos. Race registration is available at ColoradoRunnerEvents.com . Credit: DCPA David Byrne and Mala Gaonkar Theater of the Mind DENVER — \"Theater of the Mind\" is a new theatrical experience you’ll see, feel, taste and hear, co-created by Academy, Grammy, and Tony Award-winning artist David Byrne and writer Mala Gaonkar. Witness the wonders of your mind for yourself as you follow The Guide through a spectacular, 15,000-square-foot installation in a group of 16 audience members. \"Theater of the Mind\" takes place at the York Street Yards at 39th and Steele through Dec. 18. RELATED: David Byrne brings his creative talents to Denver for DCPA's latest show Credit: Saint Rafka Maronite Catholic Church Lebanese and Middle Eastern Festival LAKEWOOD — Saint Rafka Maronite Catholic Church is hosting its annual Lebanese and Middle Eastern Festival on Saturday, Sept. 3, from 11 a.m. to 10 p.m. at 2301 Wadsworth Blvd in Lakewood. Experience this unique cultural and culinary festival featuring authentic Lebanese and Middle Eastern cuisine and entertainment with fun for everyone. Credit: Keystone Festivals Keystone Oktoberfest KEYSTONE — Oktoberfest season officially arrives with Saturday's 9th annual Oktoberfest at Keystone’s River Run Village . Attendees will be raising their steins, dancing to oompah bands and savoring delicious German fare. The festival, which runs from 1 p.m. to 6 p.m., will have live music, food and seasonal beer. The festival will also have a kids’ area with crafts and dance performances from the Denver German Traditional Dance Group. If you buy a commemorative 2022 stein, you'll get three beer tokens. Stein tickets are available online . Beaver Creek Oktoberfest BEAVER CREEK — Beaver Creek’s long-running Oktoberfest is a family-friendly celebration of traditional live music, food and drink the heart of a Bavarian-inspired village. Festivities planned on Friday, Saturday and Sunday include stein-hoisting competitions, bratwurst-eating competition, kids’ zone, Oktoberfest shuffle, best-dressed contest and live music from Trachtenkapelle, The Helmet Fricker Band, Philadelphia Freedom and more. A complete schedule can be found at BeaverCreek.com . Castle Rock Brew Fest Under the Stars CASTLE ROCK — The Castle Rock Brew Fest Under the Stars is Sunday, Sept. 4 at Philip S. Miller Park. The fest will offer craft beer from more than 20 breweries, food from eight food trucks and four bands. Each ticket comes with admission, unlimited food, eight-ounce craft beer pours and live entertainment until 9 p.m. Tickets are available online . Fountain Fall Festival & Parade FOUNTAIN — The 52nd annual Fountain Fall Festival and Parade arrives Monday, Sept. 5 in Fountain. The Labor Day Parade begins at 10 a.m. Monday and will run along Main Street and Ohio Avenue. The Fall Festival opens at 10:30 a.m. at John Metcalf Park. Credit: Jazz Aspen Snowmass JAS Labor Day Experience SNOWMASS — The Jazz Aspen Snowmass Labor Day Experience is a popular three-day music festival on the grounds outside the Snowmass Village Recreation Center. This year's 31st annual lineup includes Leon Bridges, Chris Stapleton, Stevie Nicks, Little Big Town, Zach Bryan, St. Paul and the Broken Bones and more. The festival runs Friday, Sept. 2 to Sunday, Sept. 4. Tickets are sold at JazzAspenSnowmass.org. Credit: Pixar Putt Pixar Putt DENVER — Pop-up, open air mini-golf experience Pixar Putt has arrived in Denver. The experience is made up of 18 holes inspired by the stories, characters and icons from some of Disney and Pixar's most beloved films including \"Toy Story,\" \"The Incredibles,\" \"Monsters, Inc.,\" \"Finding Nemo,\" \"Coco,\" \"A Bug's Life,\" \"Wall-E,\" and \"Inside Out.\" Pixar Putt is staged at McGregor Square’s Rally Hotel beginning Saturday, Sept. 3 and running through Nov. 27. Credit: 9NEWS Nan Desu Kan AURORA — The three-day Japanese culture convention Nan Desu Kan is back this weekend at Gaylord Rockies Resort & Convention Center in Aurora. Since 1997, the event has showcased traditional Japanese arts, anime, cosplay, gaming, shopping, music, dance, voice actors, competitions, charity and more. Nan Desu Kan runs Friday, Sept. 2 through Sunday, Sept. 4. Check out the full lineup at NDKDenver.org . Credit: NPS Photo/J. Koch Bent’s Old Fort OTERO COUNTY — The public is invited to join the inhabitants of Bent’s Old Fort on Friday, Sept. 2 from 1 p.m. to 5:30 p.m. and Saturday, Sept. 3 from 8 a.m. to 5:30 p.m. to experience the sights and sounds of Bent, St. Vrain, & Company in 1847. There is no additional fee to participate in this special event. Regular park entrance fees apply. Bent’s Old Fort National Historic Site is located on Colorado Highway 194, eight miles east of La Junta. Credit: jerd nakata - stock.adobe.com Estes Park Labor Day Arts & Crafts Show ESTES PARK — The Estes Park Arts and Crafts Show brings over 100 artisans to downtown Estes Park every Labor Day weekend. This year's show runs from Saturday, Sept. 3 to Monday, Sept. 5 at Bond Park. The show, when combined with the shops and restaurants of downtown, make Estes Park a great weekend destination on the edge of Rocky Mountain National Park. Commonwheel Art Festival MANITOU SPRINGS — Manitou Springs' Memorial Park is the site of this weekend’s Commonwheel Artists Co-op 48th annual Labor Day Art Festival . The festival will be open from 10 a.m. to 5 p.m. Saturday, Sept. 3 to Monday, Sept. 5. There will be dozens of art vendors, live music, food options, beer garden and kids’ activities. Admission is free. Credit: digidreamgrafix - stock.adobe.com Windsor Cruise In Car Show WINDSOR — One of the largest car shows in northern Colorado will be held Sunday, Sept. 4 from 10 a.m. to 2 p.m. The Windsor Cruise In Car Show at Eastman Park will have categories in 20s and older, 30s, 40s, 50s, 60s, 70s, 80s, 90s and newer, trucks, and diamond-in-the-rough vehicles. There is no entry fee for car enthusiasts interested in stopping by, viewing the cars, meeting and mingling with the owners of the vehicles. Credit: Lukas Gojda - stock.adobe.com Four Corners Motorcycle Rally DURANGO — Durango, which serves as a gateway to the world famous Million Dollar Highway, is the home of this weekend's three-day Four Corners Motorcycle Rally . There will be races, stunt shows, live music, bike shows and more. Visit FourCornersMotorcycleRally.com to see a complete event schedule. Credit: Rotary Club of Vail Vail Duck Race VAIL — The Vail Rotary Club is hosting its annual rubber duck race at 3 p.m. this Sunday, Sept. 4. The club will send about 15,000 ducks down Gore Creek. The race will begin at the Covered Bridge and end at the Vail Rotary International Bridge. The owner of the first duck that enters the chute will win $5,000. This event serves as a fundraiser for the Vail Rotary which supports many Vail-area organizations. Ducks are available for adoption online . Credit: Steve Lovegrove - stock.adobe.com Ouray County Rodeo RIDGWAY — Ouray County is ready for rodeo! The 2022 Ouray County Labor Day Rodeo will be held Monday, Sept. 5 with a parade at 10 a.m., BBQ in the Park at 11 a.m. and CPRA Rodeo at 1 p.m. Active military and children under six receive free admission . Labor Day Weekend Rodeo TRINIDAD — The Trinidad Round-Up Association's 112 th an nual Labor Day Weekend is a three -day celebration at the Las Animas County Fairgrounds. The weekend includes two rodeo performances , Saturday night dance, performance by the Westernaires , beer garden, expo, concessions , vendors, stick horse races, kids ’ nickel scramble and more. The L abor Day Pa rade steps off at 9 a.m. Monday, Sept. 5 in downtown Trinidad. Credit: kojihirano - stock.adobe.com Yampa Valley Crane Fest STEAMBOAT SPRINGS — The 11th annual Yampa Valley Crane Festival will be held Thursday, Sept. 1 to Sunday, Sept. 4 in Steamboat Springs, Hayden and Craig. The festival features four-days of mostly free events, but some activities including crane-viewing shuttles and those with limited space, require advance registration and small fee. Organizers say the best way to view cranes are the four guided crane-viewing events throughout the festival. This year’s event also will have speakers, workshops, educational displays, story-telling event, aerial arts dancers, walks, coloring contest, children and family activities and more. See the full schedule at ColoradoCranes.org . Credit: Colorado National Speedway Colorado National Speedway DACONO — Colorado National Speedway will hold two nights of Labor Day weekend racing. Short track NASCAR-sanctioned racing is scheduled for Saturday, Sept. 3 and Sunday, Sept. 4 with post-race firework shows. Tickets are available at the box office or ColoradoSpeedway.com . Credit: Rocky Mountain Vibes Rocky Mountain Vibes vs. Northern Colorado Owlz COLORADO SPRINGS — The Rocky Mountain Vibes host rival Northern Colorado Owlz for three games at UCHealth Park. Thursday, Sept. 1 is Ladies Nights and Friday, Sept. 2 has post-game fireworks. Credit: Michael Pierce Photography Four Corners Folk Festival PAGOSA SPRINGS — The 26th annual Four Corners Folk Festival runs Friday, Sept. 2 to Sunday, Sept. 4 with live performances from Yonder Mountain String Band, Darrell Scott Trio, Heartless Bastards, Dirtwire, Gangstagrass, Amy Helm, William Prince and more. Credit: Amy Harris/Invision/AP Trey Anastasio of Phish Phish COMMERCE CITY — In what's become a tradition dating back to 2011 , Phish returns to Colorado over Labor Day weekend. Known for its improvisational style and dedicated fan base, the jam band will play at Dick’s Sporting Good Park on Thursday, Sept. 1, Friday, Sept. 2, Saturday, Sept. 3, and Sunday, Sept. 4. Phish's run in Colorado ends the band's 2022 summer tour. Tickets are sold at Ticketmaster.com . Credit: Kizzy O'Neal Singer-songwriter Jack Johnson will perform at Ruoff Music Center in Noblesville, Indiana, on Sunday, July 3, 2022. Jack Johnson GREENWOOD VILLAGE — Singer-songwriter Jack Johnson will bring his 2022 tour to Fiddler's Green Amphitheatre on Wednesday, Aug. 31 and Thursday, Sept. 1, with Ziggy Marley & the Melody Makers. Johnson's tour kicked off in June and wraps in October. Fiddler's Green Amphitheatre is the largest outdoor amphitheater in the Denver metro area. Credit: Colorado Tourism Office Telluride Film Festival TELLURIDE — The 49th annual Telluride Film Festival is this Labor Day weekend. The prestigious event features many films premiering for the first time in North America. From Friday, Sept. 2 to Mon day, Sept. 5, more than 50 programs will be screened in ten venues. The lineup of the Telluride Film Festival will not be revealed until the weekend. Credit: Hershey Entertainment Red Rocks DENVER — There is no better venue for live music in the country than Colorado's Red Rocks Amphitheatre! The Red Rocks 2022 concert schedule is still growing and even features some concerts postponed from 2020. Thursday, Sept. 1 - Robert Plant, Alison Krauss Friday, Sept. 2 - Nine Inch Nails Saturday, Sept. 3 - Nine Inch Nails Sunday, Sept. 4 - Kidz Bop Live Monday, Sept. 5 - Shaky Graves, Sierra Ferrell Credit: oles_photo - stock.adobe.com Movies this weekend Without any major releases this weekend, most major movie theater chains have declared Saturday, Sept. 3 as \"National Cinema Day\" with special deals and discounts. AMC, Cinemark and Regal Cinemas are participating, as are all major film studios. In participating theaters, tickets will be no more than $3 for every showing, in every format. RELATED: Coming to a theater near you: $3 movie tickets for one day Last weekend's box office The Invitation — $6.8 million Bullet Train — $5.6 million Beast — $4.8 million Top Gun: Maverick — $4.7 million Dragon Ball Super: Super Hero — 4.6 million DC League of Super-Pets — $4.1 million Three Thousand Years of Longing — $2.9 million Minions: The Rise of Gru — $2.7 million Thor: Love and Thunder — $2.6 million Where the Crawdads Sing — $2.3 million RELATED: Back to normal at the movies? What to expect this fall RELATED: 'The Invitation' tops tepid weekend at box office > Would you like to see your favorite Colorado festival, fair, expo, concert, drama, musical, ballet, run or event listed in 9Things? Send it to alexander.kirk@9news.com . 'A Taste of Colorado' — Denver Labor Day weekend tradition 1/22 A Taste of Colorado 2/22 A Taste of Colorado 3/22 Evan Semón Photography; A Taste of Colorado 4/22 A Taste of Colorado 5/22 A Taste of Colorado 6/22 A Taste of Colorado 7/22 A Taste of Colorado 8/22 A Taste of Colorado 9/22 A Taste of Colorado 10/22 A Taste of Colorado 11/22 A Taste of Colorado 12/22 A Taste of Colorado 13/22 A Taste of Colorado 14/22 A Taste of Colorado 15/22 A Taste of Colorado 16/22 A Taste of Colorado 17/22 A Taste of Colorado 18/22 A Taste of Colorado 19/22 A Taste of Colorado 20/22 A Taste of Colorado 21/22 A Taste of Colorado 22/22 A Taste of Colorado 1 / 22 × A Taste of Colorado More > Top stories curated daily just for you! Sign up for the 9NEWSLETTER to get can’t-miss stories, Next and Broncos content, weather and more delivered right to your inbox. SUGGESTED VIDEOS: Colorado Guide MORE WAYS TO GET 9NEWS Subscribe to our daily 9NEWSLETTER Download the 9NEWS APP iTunes: http://on9news.tv/itunes Google Play: http://on9news.tv/1lWnC5n HOW TO ADD THE 9NEWS APP TO YOUR STREAMING DEVICE ROKU: add the channel from the ROKU store or by searching for KUSA. For both Apple TV and Fire TV, search for \"9news\" to find the free app to add to your account. Another option for Fire TV is to have the app delivered directly to your Fire TV through Amazon."
  },
  {
    "_id": "f06f8cc035b04bd1158e4198281915a4",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "5",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 127,
    "title": "This country is the first in the world to introduce digital passports",
    "author": {
      "name": "Maureen O'Hare",
      "published_date": "2022-08-25 18:53:49",
      "img": "https://media.cnn.com/api/v1/images/stellar/prod/161123225117-maureen-ohare-2.jpg?c=16x9&q=h_720,w_1280,c_fill"
    },
    "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/230929115406-finland-digital-passport-trial.jpg?c=16x9&q=h_720,w_1280,c_fill/f_webp",
    "details": "Throw on your turtleneck, fill your suitcase with gourds and grab your pumpkin latte: Fall is when the cool kids like to travel. This is when Europe’s top destinations are serving mellow vibes after the summer rush and visitors can have their pick of balmy beach temperatures or cozy harvesttime festivals. Sometimes, roadways and natural beauty meet in a harmonious convergence where driving can be a delight – especially when the leaves are bursting with color. Here are six soothing, scenic drives across the United States to take. If you’re heading out to the woods to luxuriate in all those lovely russets and ochers, our partners at CNN Underscored, a product reviews and recommendations guide owned by CNN, have a roundup of all the essentials you need from a picnic backpack to waterproof binoculars.Raise a flask while you’re out there to the memory of one of England’s most-loved trees. A sycamore that stood alongside the UNESCO-listed Hadrian’s Wall for more than 200 years – and starred with Kevin Costner in “Robin Hood: Prince of Thieves” – was sadly felled in an act of vandalism this week. “See Troy’s OnlyFans page for exclusive tips for how a modern outlaw can best accessorise… find out why black and white are the only colours you need in your wardrobe… a showcase of latest leather trends… tips on keeping healthy. “And exclusively for OnlyFans subscribers... an inside look at the man who put the soft into soft serve, how he relaxes listing to 80s glam-rock and some cosplay as a Lego spaceman.”"
  },
  {
    "_id": "cd2b53655737cc4077542baea9f8f75d",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "2",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 700,
    "title": "Halo, GTA Vice City Actor Directing Movie About Hunter Biden",
    "author": {
      "name": "Daniel Deangelo",
      "published_date": "2022-08-30 20:02:52",
      "img": "https://th.bing.com/th/id/R.95d2259d4be7cedf32a09c3bcea2ca3f?rik=oSGhIjHEPRl82w&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://media.breitbart.com/media/2021/08/davimysonhunter1-640x335.jpg",
    "details": "Robert Davi will be a pretty familiar face to fans of entertainment from the 1980s and 1990s, with supporting roles in The Goonies, Die Hard, and many other films and TV shows. He also lent his voice to Colonel Juan Cortez, a significant character in Grand Theft Auto: Vice City. Meanwhile, Halo fans will recognize his voice as that of the Elite Shipmaster Ratas Vadum from Halo 2 and Halo 3. He's responsible for some of the trilogy's most iconic scenes, including his speech in Halo 2 and 'Then it is an even fight' line in Halo 3."
  },
  {
    "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "7",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 300,
    "title": "Haim look back at their first decade: 'No-one wanted to sign us!'",
    "author": {
      "name": "Monica Santana",
      "published_date": "2022-08-24 22:30:00",
      "img": "https://th.bing.com/th/id/R.ee6ce56aeb1c0dcc00075fb75b92f8c1?rik=Vn6sHZC5niFTmA&riu=http%3a%2f%2fsusanshacter.com%2fwp-content%2fgallery%2fheadshots-women-5%2f30-30Monica-Santana.jpg&ehk=TOs2E%2fFW8264wv2J1zYgtdpkzxX%2bGAbucdOhsfADDkM%3d&risl=&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://ichef.bbc.co.uk/wwhp/999/cpsprodpb/4E91/production/_131331102_gettyimages-170269889.jpg",
    "details": "Eleven years ago, on a cold and dark December evening, I squeezed into an anonymous dressing room at the O2 arena for my first interview with Haim. They didn't know it at the time, but the group were about to win the BBC's Sound of 2013. My job was to profile the band, without giving away the secret. As we spoke, Florence + The Machine started playing in the auditorium above our heads. The walls shook, a guitar case fell over. We exchanged nervous glances. 'The worst part is,' said bassist Este Haim,/ 'no-one is going to remember that we're in here. 'It's going to be the saddest BBC poll ever. 'They would have got to number three but they unfortunately passed away at the O2 arena'.' Thankfully, the seismic activity subsided and Haim lived to tell the tale. They won the poll, celebrating with a victory dance at Madame Tussauds, and went on to become one of the world's biggest bands. Their latest album, Women In Music Part III, was nominated for album of the year at the Grammys, and they've just been whisked around America by Taylor Swift as the support act on her Eras tour. We meet again this August, a day after the trio's headline set at London's All Points East festival. 'I cried through the first three songs,' admits Alana, the youngest Haim sister, who's also a Bafta-nominated actress for her role in Licorice Pizza. The concert was an emotional form of homecoming for the band who, despite hailing from California's San Fernando Valley, were signed to the UK's Polydor Records in 2012 after every American label passed. This year marks the 10th birthday of their debut album Days Are Gone and, with an anniversary edition pushing it back into the Top 40, I sit down with Haim to recall the protracted sessions that led to the record - and to finally admit my decade-long duplicity. 'You knew we'd won the whole time? Oh my God, that's hilarious,' laughs Danielle. 'I feel like we blinked three times and 10 years passed,' adds Alana. 'Or maybe that's just the jet lag?'"
  },
  {
    "_id": "7c4dfea0fafddc813673282a428429b7",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 0,
    "title": "Holly Willoughby: Man charged over alleged kidnap plot",
    "author": {
      "name": "Mark Savage and Peter Walker",
      "published_date": "2022-08-25 03:09:16",
      "img": "https://th.bing.com/th/id/R.b4ff24ddce57e7318b48db9a7c5d7777?rik=a%2fXVwLlJk3%2bBQQ&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://th.bing.com/th/id/R.2bbd78dc4aa627dc7ff325e7585dda2c?rik=ds6jv00uaPmAaA&pid=ImgRaw&r=0",
    "details": "A man has been charged with soliciting to commit murder over a reported plot to kidnap TV presenter Holly Willoughby. Gavin Plumb, 36, was arrested on Wednesday 'as part of an ongoing investigation', Essex Police said. He was also charged with incitement to commit kidnap. Willoughby did not appear on Thursday's edition of ITV show This Morning. She was said to be under police protection at her home on Thursday night. The suspect is in custody and is due to appear at Chelmsford Magistrates' Court later. Essex Police did not confirm whether Willoughby had been the target of the alleged plot, which was first reported in The Sun. The newspaper said police had found 'sinister' messages threatening to kidnap and 'seriously' harm the star, adding that digital devices and a mobile phone were seized during the arrest. In a statement, Det Supt Rob Kirby said: 'This was an extremely fast paced investigation, with many of our officers and national partners working overnight to secure these charges. 'The safeguarding of any victim is paramount and we will continue to prioritise this and working with the Metropolitan Police Service as the investigation proceeds.'"
  },
  {
    "_id": "30af81e91ab3eafc0bcae0de62f55d5c",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 320,
    "title": "U.S. announces largest weapons package for Ukraine",
    "author": {
      "name": "John Pike",
      "published_date": "2022-08-25 07:35:11",
      "img": "https://i1.wp.com/www.dragonbladepublishing.com/wp-content/uploads/man_author_2.jpg?ssl=1"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://i.pinimg.com/originals/0f/27/79/0f277970e457781940f986d3fab49b72.jpg",
    "details": "People's Daily Online (Xinhua) 08:16, August 25, 2022 The United States has committed more than 13.5 billion dollars in security assistance to Ukraine since President Joe Biden took office. WASHINGTON, Aug. 24 (Xinhua) -- The United States on Wednesday announced an additional tranche of security assistance to Ukraine worth nearly 3 billion U.S. dollars, the largest one-time weapons aid to Kiev that came as the Russia-Ukraine conflict reached the half-year mark. According to a breakdown by the Department of Defense (DoD), items in the newly-announced package include six additional National Advanced Surface-to-Air Missile Systems (NASAMS) with additional munitions for NASAMS, up to 245,000 rounds of 155mm artillery ammunition, up to 65,000 rounds of 120mm mortar ammunition, up to 24 counter-artillery radars, Puma Unmanned Aerial Systems (UAS) and support equipment for Scan Eagle UAS systems,   Vampire   counter-UAS systems, as well as laser-guided rocket systems."
  },
  {
    "_id": "df11ff9feefc37613cc3a4486ce02151",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "2",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 552,
    "title": "Stunning photos of leopards are helping to protect this elusive big cat",
    "author": {
      "name": "Lily",
      "published_date": "2022-08-27 05:38:02",
      "img": "https://th.bing.com/th/id/OIF.iM63uwTUJtYkvNJ1czFGQw?pid=ImgDet&rs=1"
    },
    "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/221130093616-22-peoples-choice-wildlife-photographer-of-the-year-2022.jpg?c=16x9&q=h_438,w_780,c_fill",
    "details": "As their populations dwindle worldwide, photographing leopards in the wild is becoming increasingly difficult. It is also becoming harder to imagine a secure future for one of nature’s most captivating animals. Through her Remembering Wildlife project, British photographer Margot Raggett is fighting against this trend. She started the initiative in 2016, and every year since then it has produced a photo book dedicated to one type of animal, capturing its beauty in images from across the globe. All profits are donated to conservation efforts for that animal, with more than £1 million ($1.2 million) raised since the project began, according to Remembering Wildlife. In this year’s edition, the leopard takes center stage."
  },
  {
    "_id": "919db97c34e0778b387dd40cdfa08130",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 89,
    "title": "U.S. concerned about India's participation in Russia military exercises",
    "author": {
      "name": "Kaji Hitomi",
      "published_date": "2022-08-30 18:05:42",
      "img": "https://pbs.twimg.com/media/Fx6J3NmaYAMgXgY.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/230927112727-02-body-amazon-river-expedition-mantaro.jpg?c=original&q=w_1280,c_fill",
    "details": "The planned 7,000-kilometer (4,350-mile) spring expedition route will span the Amazon River’s course through Peru, Colombia and Brazil, starting at its newly purported source at the Mantaro, deep in the Peruvian Andes. The Mantaro’s white waters will be navigated on a rafting expedition with Contos at the helm; once the Mantaro meets the Ene River, the voyage’s longer segment will begin aboard a trio of custom-built solar- and pedal-powered boats that will follow the remainder of the Amazon out to the Atlantic Ocean, on the Brazilian coast. Sanada says that in early 2025 there will be a secondary expedition starting at the Apurimac River in Peru, the traditionally accepted source of the Amazon, which will allow for a second set of measurements. This segment will reportedly be accompanied by French explorer Celine Cousteau (granddaughter of famed oceanographer Jacques Cousteau) via horseback ride along the riverbanks. Sanada is currently overseeing a team of roughly 50 collaborators on the project from across the Americas and Europe. The expedition has already secured some prestigious partnerships: support from the Explorers Club, an IMAX deal for a related film production and an assignment to produce a new Amazon river map for Harvard University."
  },
  {
    "_id": "374df11ae3d9b8b9ce21f4dc53f59b85",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 798,
    "title": "Zelensky says he had ‘great conversation' with Biden, discussed Kiev's further steps",
    "author": {
      "name": "Nao KanZaki",
      "published_date": "2022-08-25 18:45:00",
      "img": "https://1.bp.blogspot.com/-DVJe4cS8Z_4/XcYVgAV1VWI/AAAAAAAF2-4/A-BVbX0KJk85RVr5sK4Na35oxmtEFrBTgCLcBGAsYHQ/s1600/1ffff.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/230925160811-zelensky-unga-092523.jpg?c=16x9&q=h_720,w_1280,c_fill/f_webp",
    "details": "KIEV, August 25. /TASS/. Ukrainian President Vladimir Zelensky said he had a   great   phone conversation with his US counterpart Joe Biden and discussed with him Ukraine's further actions on Thursday.    Had a great conversation with @POTUS. Thanked for the unwavering U.S. support for Ukrainian people - security and financial,   he wrote on Twitter.   We discussed Ukraine's further steps,   Zelensky added.  On Wednesday, US President Joe Biden announced $2.98 bln in military aid to Ukraine. On the same day, Ukrainian Prime Minister Denis Shmygal reported that the Ukrainian state budget received grant aid from the US in the amount of $3 bln."
  },
  {
    "_id": "acb9b6785b62698fc6130db7615965e1",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "3",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 879,
    "title": "Nobel Prize awarded for discovery of quantum dots that changed everything from TV displays to cancer imaging",
    "author": {
      "name": "Allen Shoff",
      "published_date": "2022-08-25 11:53:13",
      "img": "https://th.bing.com/th/id/OIP.YSd6igVlMFaUiVYSJIhWOQHaE7?pid=ImgDet&rs=1"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/231004122628-02-quantum-dots.jpg?c=16x9&q=h_720,w_1280,c_fill/f_webp",
    "details": "The 2023 Nobel Prize in chemistry has been awarded to a trio of scientists who worked to discover and develop quantum dots, used in LED lights and TV screens, as well as by surgeons when removing cancer tissue. Moungi Bawendi, Louis Brus and Alexei Ekimov were lauded as “pioneers in the exploration of the nanoworld” by the Nobel committee for chemistry as it announced the prize in Swedish capital Stockholm on Wednesday. “For a long time, nobody thought you could ever actually make such small particles. But this year’s laureates succeeded,” said Johan Aqvist, chair of the committee. Heiner Linke, a member of the chemistry committee, explained at the announcement ceremony what made the laureates’ work so revolutionary. Bawendi, a professor at the Massachusetts Institute of Technology, and Brus, professor emeritus at Columbia University, are American. Ekimov is Russian and works for Nanocrystals Technology Inc., which is based in New York. France-born Bawendi, got an early morning call from Stockholm breaking the news that he is one of the 2023 chemistry laureates. He told the news conference he felt “very surprised, sleepy, shocked, unexpected and very honored” and would celebrate his win by teaching his 9 a.m. class at MIT."
  },
  {
    "_id": "be44c843d61859cc0b87cae85c55f9db",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "1",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 231,
    "title": "US to name military mission in Ukraine and appoint commander – WSJ",
    "author": {
      "name": "Cengiz Dervis",
      "published_date": "2022-08-26 12:15:36",
      "img": "https://m.media-amazon.com/images/M/MV5BZmI5YTM5OGItOTg0Ny00ZjEyLTkwN2ItZDk2YjM3ZTNiODIxXkEyXkFqcGdeQXVyMjA5NDk0NTA@._V1_FMjpg_UY600_.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
    "image_url": "https://mil.in.ua/wp-content/uploads/2022/06/photo_2022-06-23-14.45.34-1.jpeg",
    "details": "Illustrative public photo In the coming weeks, the Joe Biden administration plans to name its military mission to support Ukraine and appoint a general to lead the military training and relief efforts. This is reported by The Wall Street Journal, citing US officials. The name of the operation formally recognizes US military support, akin to how the Pentagon dubbed the missions in Iraq and Afghanistan Operation Iraqi Freedom,   Enduring Freedom   and 'Guardian of Freedom'. The naming of training and assistance is of great bureaucratic importance, as it usually entails long-term dedicated funding and the possibility of special pay, rewards for military personnel participating in these missions."
  },
  {
    "_id": "1b03149c50f1bec662062d930bf46489",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "2",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 546,
    "title": "Opinion: After a summer of surprising successes, President Biden is on a roll",
    "author": {
      "name": "Fitzgerld",
      "published_date": "2022-08-30 22:00:00",
      "img": "https://th.bing.com/th/id/OIP.FYYiTUvV7sOnp4OjN_tetAHaLL?pid=ImgDet&rs=1"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://i.ibb.co/M23fhxm/unsplash-Eh-Tc-C9s-YXsw.png",
    "details": "Advertisement Advertisement Today at 6:00 p.m. by The Philadelphia Inquirer President Joe Biden delivers remarks on the Safer America Plan, intended to prevent dangerous people from accessing firearms, at the Arnaud C. Marts Center in Wilkes-Barre, Penn. on Tuesday Aug. 30, 2022. (Doug Mills/The New York Times)   It is time to give President Joe Biden his due. While Biden's approval rating doesn't reflect it, Uncle Joe is on a roll. After some bumpy months, gas prices are dropping, unemployment is at record lows, the job market is booming, incomes are rising, a top al-Qaida leader was taken out, the first Black female Supreme Court justice was seated, NATO has expanded, and Biden unified European support for Ukraine in its fight against Russia."
  },
  {
    "_id": "7f5b80c1cdd4df0111918883eae07349",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "3",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 1870,
    "title": "Ukraine receives more military aid from allies on its independence day",
    "author": {
      "name": "Cdidrah",
      "published_date": "2022-08-24 23:15:00",
      "img": "https://thumbs.dreamstime.com/b/portrait-man-5974852.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://mil.in.ua/wp-content/uploads/2022/08/Mizhnarodni-navchannya-Rapid-Trident.jpg",
    "published_date": "2022-08-24 18:00:00",
    "details": "U.S. President Joe Biden announced Wednesday that he is sending $2.98 billion US in new... read full story"
  },
  {
    "_id": "17d266b79d2fcd850cd4d983c3aeb95f",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "7",
    "rating": {
      "number": 4.2,
      "badge": "Excellent"
    },
    "total_view": 354,
    "title": "‘Self-obsessed liar’: Meghan mocked for Mandela story",
    "author": {
      "name": "Christine Snyder",
      "published_date": "2022-08-30 17:44:16",
      "img": "https://th.bing.com/th/id/R.53ceb551d4a66e5e1b0fd0f6471dc97d?rik=3Ki6oBNA26rO%2bg&pid=ImgRaw&r=0"
    },
    "thumbnail_url": "https://i.ibb.co/j86wjDW/unsplash-Eh-Tc-C9s-YXsw-20.png",
    "image_url": "https://i.ibb.co/hxG29nr/unsplash-Eh-Tc-C9s-YXsw-9.png",
    "details": "Meghan Markle's Nelson Mandela story continues to unravel after the only South African cast member of 'The Lion King' said he was \"baffled\" by her suggestion that he told her his country had \"rejoiced\" when she married Prince Harry. The former Suits actress recalled an encounter she had at the 2019 London premiere of 'The Lion King' with an actor from South Africa who made a comparison to her wedding with Prince Harry and Nelson Mandela. “He looked at me, and he’s just like light. He said, ‘I just need you to know: When you married into this family, we rejoiced in the streets the same we did when Mandela was freed from prison,’” she said during an interview with The Cut. The Daily Mail revealed Dr John Kani, who claims he was the only South African actor in the film, said he did not attend the premiere and had never met the Duchess of Sussex. \"I have never met Meghan Markle,\" he told the MailOnline. \"This seems like something of a faux pas by her. I have I have never met the duchess at all. I am the only South African member of the cast and I did not attend the premiere in London. \"The only South African was me playing Rafiki. But I did not go to the opening in Leicester Square as I didn't have the time to do that. It just may be a mis-remembering on her side. \"It is baffling me.\" Nelson Mandela’s grandson said he was “surprised” when he heard Ms Markle compare her wedding with Prince Harry to his grandfather being freed from prison. He said it “cannot be equated to as the same\". The Duchess of Sussex was met with heavy criticism online after she told the story to The Cut. \"The damage her and her husband are doing to the Queen and the Royal Family is incalculable... these two hypocritical, self-obsessed liars are in the end going to be ignored,\" said Nigel Farage"
  },
  {
    "_id": "61f9ce168f7b15aadecb1d1fc80c72f0",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "5",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 100,
    "title": "California to phase out sales of gas-powered cars",
    "author": {
      "name": "Christopher Winchester",
      "published_date": "2022-08-26 00:37:24",
      "img": "https://vignette.wikia.nocookie.net/peter-jacksons-mortal-engines/images/2/23/Christopher_Winchester.jpg/revision/latest/scale-to-width-down/361?cb=20170619221856"
    },
    "thumbnail_url": "https://i.ibb.co/L507x2V/unsplash-Eh-Tc-C9s-YXsw-14.png",
    "image_url": "https://i.ibb.co/tKsvCyR/unsplash-Eh-Tc-C9s-YXsw-3.png",
    "details": "Associated Press  Six months after Russia's invasion of Ukraine, President Joe Biden announced Wednesday that he is sending $2.98 billion in new military aid to Ukraine that will provide longer-term weapons and training to enable forces there to fight for years to come. In a statement, Biden said the aid will allow Ukraine to acquire air defense systems, artillery systems and munitions, drones and other equipment 'to ensure it can continue to defend itself over the long term.' The announcement comes as Ukraine is celebrating its 1991 declaration of independence from the Soviet Union."
  },
  {
    "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "4",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 100,
    "title": "“Max Verstappen has plenty trophies” – Lando Norris wants $50 Million a year Dutch sensation to give him his trophy",
    "author": {
      "name": "Tejas Venkatesh",
      "published_date": "2022-08-26 00:37:24",
      "img": "https://thumbs.dreamstime.com/b/face-man-16726762.jpg"
    },
    "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
    "image_url": "https://i.ibb.co/CVg1Nrt/unsplash-Eh-Tc-C9s-YXsw-5.png",
    "details": "Lando Norris asks Max Verstappen to lend him the 2022 Dutch GP trophy as he predicts the Dutchman as a sure winner. Max Verstappen returns to his home Grand Prix in Zandvoort for the 2022 Dutch GP. And it seems like the Dutchman will enjoy another easy victory this weekend. Max has a 93-point advantage in the drivers’ championship over Ferrari’s Charles Leclerc ahead of the race. And at this rate, Max can cruise comfortably, to claim his 2nd Championship title this season. But Max does not want to lose his focus and momentum ahead of his home GP. He wants to claim his 10th win of the season in front of his home crowd in style. Recently, the Dutch GP unveiled a rather unique-looking trophy. And McLaren driver Lando Norris liked the new trophy.   a journalist asks lando if he likes the dutch gp trophy and if it will be his on sunday: “no, it’s max’s. everyone knows it’s max’s already. maybe max will give it to me, he has plenty.” i love lando norris and max verstappen friendship pic.twitter.com/LQh9cnwjLv — comfort lando norris (@safeforlando) August 31, 2022 The Brit was grabbing a bicycle in the F1 paddock when he was interviewed by Dutch press personnel. Norris was asked what he thought of the Dutch Grand Prix trophy. Norris replied, “Oh I loved it.” But he admitted he would not be able to take the trophy home. He said, “No, it’s Max’s. Everyone knows it’s Max’s already. Maybe he will give it to me, he has plenty.” Seems like Norris is not alone. As it is becoming more obvious amongst the drivers that the Dutch GP trophy has Max’s name written on it. And with a win this Sunday, even the Championship might have Max’s name for a second time. Also Read: Lando Norris hits out at Daniel Ricciardo amidst his $16.7 Million contract termination Max Verstappen unveils a new helmet for the Dutch GP Max Verstappen became the first Dutch driver to win an F1 race when he won the 2016 Spanish GP. He also became the first Dutchman to win the Championship title. And he would like to pay tribute to his father, Jos Verstappen who coached him during his karting days and developed him as a racing driver. Jos has also served as a manager for Max. Jos was an F1 driver who raced in F1 from 1994 to 2003. He has 106 race starts with no wins and he raced for a variety of teams from Benetton, Arrows, Tyrell and Honda. And for the Dutch GP, Max would be wearing a helmet that resembles the one worn by his father. He will be wearing it on a track on which he has raced numerous times while Karting with his father.   ᴀ ᴛʀɪʙᴜᴛᴇ ᴛᴏ ᴊᴏs ᴠᴇʀsᴛᴀᴘᴘᴇɴ Returning to Zandvoort as a World Champion, Max chose to honor his mentor and Dad by using Jos his iconic helmet design as an inspiration 1:2 and 1:4 scale models are now available https://t.co/SxY1Y14OH2 pic.twitter.com/tz2DdtXJM4 — Max Verstappen (@VerstappenCOM) August 30, 2022 Verstappen said in a video posted by him, “It’s a bit emotional as well. But I think it’s just really special to drive something like this because it’s also how I started in go-karting.” He added, “All the old pictures I have of go-karting are with this iconic design. So that’s why we thought it was a great idea to bring this back alive around Zandvoort.” Jos has never won a race in his F1 career. But wearing this helmet, Max might win his 10th race of the season and cement his name on the Championship trophy. Also Read: Max Verstappen can equalize Michael Schumacher-Sebastian Vettel joint record if he wins 4 more races in 2022 The post “Max Verstappen has plenty trophies” – Lando Norris wants $50 Million a year Dutch sensation to give him his trophy appeared first on The SportsRush."
  }
]